---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedShapeBuilderOutcome.Mixed
enum: Autodesk.Revit.DB.TessellatedShapeBuilderOutcome
source: html/d5cda534-1755-bd50-aafe-11143063a3e0.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderOutcome.Mixed

A geometry and a mesh were created